toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
//        _Pin::VDD_B_EN::Write(1);
//        _Scheduler::Sleep(_Scheduler::Ms(250));
//        
//        for (;;) {
//            _ICE::Transfer(_ICE::LEDSetMsg(0xFF));
//            _Scheduler::Sleep(_Scheduler::Ms(250));
//            
//            _ICE::Transfer(_ICE::LEDSetMsg(0x00));
//            _Scheduler::Sleep(_Scheduler::Ms(250));
//        }
        
//        for (;;) {
//            _Scheduler::Sleep(_Scheduler::Ms(1000));
//        }
        
        // Reset our state
        Reset();
        
        // Init SPI peripheral
        _SPI::Init();
        
        for (;;) {
//            // Wait for motion. During this block we allow LPM3.5 sleep, as long as our other tasks are idle.
//            {
//                _WaitingForMotion = true;
//                _Scheduler::Wait([&] { return (bool)_Motion; });
//                _Motion = false;
//                _WaitingForMotion = false;
//            }
            
            // Wait for an event
            static _Triggers::Event* ev = nullptr;
            _Scheduler::Wait([] { return (bool)(ev = _Triggers::EventPop(_RTC::TimeRead())); });
            
            // Stay powered while we handle the event
            _Power.acquire();
            
//            TimeTrigger,        // idx: _TimeTrigger[]
//            MotionEnable,       // idx: _MotionTrigger[]
//            MotionDisable,      // idx: _MotionTrigger[]
//            MotionUnsuppress,   // idx: _MotionTrigger[]
//            CaptureImage,       // idx: _Capture[]
            
            using T = _Triggers::Event::Type;
            switch (ev->type) {
            case T::TimeTrigger:      _TimeTrigger(*ev);      break;
            case T::MotionEnable:     _MotionEnable(*ev);     break;
            case T::MotionDisable:    _MotionDisable(*ev);    break;
            case T::MotionUnsuppress: _MotionUnsuppress(*ev); break;
            case T::CaptureImage:     _CaptureImage(*ev);     break;
            }
            
//            // Light the red LED if this is a manual trigger
//            if (trigger & _TriggerSources::Manual) {
//                _LEDRed_::Set(_LEDPriority::Capture, 0);
//            }
            
            // Release power assertion
            _Power.release();
            
//            // Release control of the LED
//            _LEDRed_::Set(_LEDPriority::Capture, std::nullopt);
        }
    }
    
//    static bool DeepSleepOK() {
//        // Permit LPM3.5 if we're waiting for motion, and neither of our tasks are doing anything.
//        // This logic works because if _WaitingForMotion==true, then we've disabled both _TaskSD
//        // and _TaskImg, so if the tasks are idle, then everything's idle so we can enter deep
//        // sleep. (The case that we need to be careful of is going to sleep when either _TaskSD
//        // or _TaskImg is idle but still powered on, which the _WaitingForMotion check takes
//        // care of.)
//        return _WaitingForMotion                &&
//               !_Scheduler::Running<_TaskSD>()  &&
//               !_Scheduler::Running<_TaskImg>() ;
//    }
    
    static inline _PowerAssertion _Power;
    
    // Task stack
    [[gnu::section(".stack._TaskMain")]]
    alignas(void*)
    static inline uint8_t Stack[256];
};

static void _CapturePause() {
    _TaskMain::Reset();
}

static void _CaptureResume() {
    _TaskMain::Start();
}

struct _TaskI2C {
    static void Run() {
        for (;;) {
            // Wait until the I2C lines are activated (ie VDD_B_3V3_STM becomes powered)
            _I2C::WaitUntilActive();
            
            // Maintain power while I2C is active
            _PowerAssertion power;
            power.acquire();
            
            for (;;) {
                // Wait for a command
                MSP::Cmd cmd;
                bool ok = _I2C::Recv(cmd);
                if (!ok) break;
                
                // Handle command
                const MSP::Resp resp = _CmdHandle(cmd);
                
                // Send response
                ok = _I2C::Send(resp);
                if (!ok) break;
            }
            
            // Cleanup
            
//            // Relinquish LEDs, which may have been set by _CmdHandle()
            _LEDRed_::Set(_LEDPriority::I2C, std::nullopt);
            _LEDGreen_::Set(_LEDPriority::I2C, std::nullopt);
            
            // Release capture-pause assertion if it was held
            _HostMode = {};
        }
    }
    
    static MSP::Resp _CmdHandle(const MSP::Cmd& cmd) {
        using namespace MSP;
        switch (cmd.op) {
        case Cmd::Op::StateRead: {
            const size_t off = cmd.arg.StateRead.off;
            if (off > sizeof(_State)) return MSP::Resp{ .ok = false };
            const size_t rem = sizeof(_State)-off;
            const size_t len = std::min(rem, sizeof(MSP::Resp::arg.StateRead.data));
            MSP::Resp resp = { .ok = true };
            memcpy(resp.arg.StateRead.data, (uint8_t*)&_State+off, len);
            return resp;
        }
        
        case Cmd::Op::StateWrite: {
            const size_t off = cmd.arg.StateWrite.off;
            if (off > sizeof(_State)) return MSP::Resp{ .ok = false };
            const size_t rem = sizeof(_State)-off;
            const size_t len = std::min(rem, sizeof(MSP::Cmd::arg.StateWrite.data));
            memcpy((uint8_t*)&_State+off, cmd.arg.StateWrite.data, len);
            return MSP::Resp{ .ok = true };
        }
        
        case Cmd::Op::LEDSet:
            _LEDRed_::Set(_LEDPriority::I2C, !cmd.arg.LEDSet.red);
            _LEDGreen_::Set(_LEDPriority::I2C, !cmd.arg.LEDSet.green);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::TimeGet:
            return MSP::Resp{
                .ok = true,
                .arg = { .TimeGet = { .time = _RTC::TimeRead() } },
            };
        
        case Cmd::Op::TimeSet:
            _RTC::Init(cmd.arg.TimeSet.time);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::HostModeSet:
            if (cmd.arg.HostModeSet.en != _HostMode.acquired()) {
                if (cmd.arg.HostModeSet.en) {
                    _HostMode.acquire();
                } else {
                    _HostMode.release();
                }
            }
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::VDDIMGSDSet:
            _VDDIMGSDSet(cmd.arg.VDDIMGSDSet.en);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::BatteryChargeLevelGet: {
            return MSP::Resp{
                .ok = true,
                .arg = { .BatteryChargeLevelGet = { .level = _BatterySampler::Sample() } },
            };
        }
        
        default:
            return MSP::Resp{ .ok = false };
        }
    }
    
    static bool HostModeEnabled() {
        return _HostMode.acquired();
    }
    
